app/controllers/sessions_controller.rb

  def create  # Need to implement whether it's vendor or user
    auth = request.env["omniauth.auth"]

    provider = Provider.find_by_provider_and_email(auth["provider"], auth["info"]["email"])
    if provider != nil
      session[:provider_id]= provider.id
      redirect_to '/providers/home', notice: "home page, Provider"
    else
      vendor = Vendor.find_by_provider_and_email(auth["provider"], auth["info"]["email"])
      if vendor != nil
        session[:vendor_id]= vendor.id
        redirect_to '/vendors/home', notice: "home page, vendor"
      else
        user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
SELECT "providers".* FROM "providers" WHERE "providers"."provider" = 'github' AND "providers"."email" = 'fox@cs.berkeley.edu' LIMIT 1
SELECT "vendors".* FROM "vendors" WHERE "vendors"."provider" = 'github' AND "vendors"."email" = 'fox@cs.berkeley.edu' LIMIT 1
INSERT INTO "users" ("code", "created_at", "email", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["code", nil], ["created_at", Thu, 07 Apr 2016 15:41:08 UTC +00:00], ["email", nil], ["name", "foo"], ["provider", :facebook], ["uid", "1234"], ["updated_at", Thu, 07 Apr 2016 15:41:08 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'amazon' AND "users"."uid" = '24323423' LIMIT 1

  def customer
    if session[:user_id] != nil
      current_user = User.find(session[:user_id])
      # debugger
      @list_codes, @instruction, @description, @help, @expiration, @website, @cashValue, @total = {},{},{},{},{},{},{},0

      if current_user.code.nil? # provider code
        redeemifyCode = RedeemifyCode.where(:code => params[:code], :user_id => nil).first
        if redeemifyCode != nil # if provider code is match with enter code
          # 1st time
          redeemifyCode.update_attributes(:user_id => current_user.id, :user_name => current_user.name, :email => current_user.email)
          provider = Provider.all.first
          provider.update_attribute(:usedCodes, provider.usedCodes + 1)
          provider.update_attribute(:unclaimCodes, provider.unclaimCodes - 1)


          @current_code = params[:code]

          current_user.code = @current_code
          current_user.save!

          @vendors = Vendor.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "provider_codes" SET "user_id" = 1, "user_name" = 'foo', "updated_at" = '2016-04-07 15:41:08.665428' WHERE "provider_codes"."id" = 1
UPDATE "providers" SET "unclaimCodes" = 0, "updated_at" = '2016-04-07 15:41:08.670611' WHERE "providers"."id" = 1
UPDATE "users" SET "code" = '12345', "updated_at" = '2016-04-07 15:41:08.672051' WHERE "users"."id" = 1
SELECT "providers".* FROM "providers"
SELECT "vendors".* FROM "vendors"