app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    if current_user.nil?
      @current_user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "code" = '9283084', "updated_at" = '2015-03-13 07:44:12.697986' WHERE "users"."id" = 1
---
  def offer
    current_user = User.find(session[:user_id])
    if current_user.code.nil? || current_user.code == ""
      @current_code = params[:code]
      current_user.code = @current_code
      current_user.save!