app/controllers/vendors_controller.rb

SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = ? LIMIT 1  [["id", 1]]
---
  def home
    @vendor = Vendor.find(session[:vendor_id])